Revit 2026 API

# DocumentSetErase Method

---

Removes a specified object from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	Document item
)
```
```vb
Public Overridable Function Erase (
	item As Document
) As Integer
```
```cpp
public:
virtual int Erase(
	Document^ item
)
```
```fsharp
abstract Erase :
        item : Document -> int
override Erase :
        item : Document -> int
```

#### Parameters

item Document
    The item to be erased.

#### Return Value

Int32The number of items that were erased from the set.

#### Reference

DocumentSet Class

Autodesk.Revit.DB Namespace